Revit 2024 API
IExporterIFC Members
The IExporterIFC type exposes the following members.
Methods
Name | Description
ExportIFC
 The method that Revit will invoke to perform an export to IFC.
GetDescription
 Implement this method to return a description of the server.
 (Inherited from IExternalServer.)
GetName
 Implement this method to return the name of the server.
 (Inherited from IExternalServer.)
GetServerId
 Implement this method to return the id of the server.
 (Inherited from IExternalServer.)
GetServiceId
 Implement this method to return the id of the service.
 (Inherited from IExternalServer.)
GetVendorId
 Implement this method to return the id of the vendor of the server.
 (Inherited from IExternalServer.)
See Also
IExporterIFC Interface
Autodesk.Revit.DB.IFC Namespace